---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilderResult.HasInvalidData
source: html/032f5f15-04f3-1257-14a2-2eb47d7bdf36.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderResult.HasInvalidData Property

Whether there were any inconsistencies in the face sets,
 stored in the tessellated shape builder while building
 geometrical objects.

## Syntax (C#)
```csharp
public bool HasInvalidData { get; }
```